Tekla Open API Reference for Tekla Structures 2025
RectangleAttributes Constructor
Overload List
Name | Description
Rectangle.RectangleAttributes()
 Creates a new default rectangle attributes instance that loads standard attributes.
Rectangle.RectangleAttributes(String)
 Creates a new rectangle attributes instance that loads the specified attributes.
Top
See Also
Reference
Rectangle.RectangleAttributes Class
Tekla.Structures.Drawing Namespace